# 405 Створіть список на основі введеної послідовності цілих чисел і надрукуйте другу половину списку як у вихідних даних.
# l = [7,2,1,0,4,2,5]
# #l = [7,2,1,0,4,2]
# n = int(len(l)/2)
# for i in range(n, len(l)):
#     print(l[i], end=" ")
import sys

# 406 Створіть список на основі введеної послідовності цілих чисел і надрукуйте його елементи таким чином: два останні
# елементи переміщені з кінця в початок списку без зміни їх початкового порядку.
# l = [7,2,1,0,4,2,5]
# res = l[-2:] + l[0:-2]
# for i in range(len(res)):
#      print(res[i], end=" ")

# 407 Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку.
# Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку.
# Відсортуйте список в алфавітному порядку і виведіть його елементи в рядку через пропуск.

# 408 Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку.
# Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку.
# Відсортуйте список в порядку протилежному алфавітному і виведіть його елементи в рядку через пропуск.
# s = input("Write languages: ")
# l = s.split(" ")
# # l = ['Ukrainian', 'French', 'Bulgarian', 'Norwegian', 'Latvian']
# #l.sort()
# res = sorted(l)
# print(res)
# print(l)
# for i in range(len(res)):
#     print(res[i], end=" ")
#
# print("\t")
#
# n = len(res)-1
# while n >= 0:
#     print(res[n], end=" ")
#     print(l[n], end=' ')
#     n-=1

# 411 Виведіть всі елементи списку з парними індексами. Вводиться список чисел. Всі числа списку знаходяться на одному рядку.
# s = input("Write numbers: ")
# l = s.split(" ")
#
# for i in range(len(l)):
#     if i%2 == 0:
#         print(l[i], end=" ")
#
# 412 Напишіть програму, яка роздруковує лише ті елементи введеного списку, що менше введеного значення n. Список містить унікальні значення.
# s = input("Write numbers: ")
# l = s.split(" ")
# n = int(input("write a max num: "))
#
# for i in range(len(l)):
#     if int(l[i]) < n:
#         print(l[i], end=" ")

# 421 Вводиться список цілих чисел в одному рядку через пропуск. Надрукуйте кількість елементів, які є за значенням більші за обох їх сусідів.
# Перший і останній елементи списку не слід розглядати, оскільки вони не мають двох сусідів.

# s = input("Write numbers: ")
# l = s.split(" ")
# cnt = 0
#
# for i in range(1, len(l) - 1):
#     if int(l[i]) > int(l[i-1]) and int(l[i]) > int(l[i+1]):
#         cnt+=1
#         i+=1
#
# print(cnt)

# 422 Напишіть програму, яка отримує повне ім’я файлу від користувача та друкує на екрані розширення отриманого файлу.
# import os
#
# s = input("Write file: ")
# ext = s.index(".") + 1
# print(s[ext:])
#
# file_name = s
# file_extension = os.path.splitext(file_name)[1]
# print(file_extension)

# 423 Напишіть програму розрахунку суми цілих чисел, які вводяться користувачем в одному рядку через пропуск. Цикл використовувати не можна.

# s = input("Write numbers: ")
# l = s.split(" ")
# lst = map(int, l)
# res = sum(lst)
#
# print(res)

# 424 Визначте, скільки різних слів у введеному рядку.
# s = input("Write words: ")
# l = s.split(" ")
# print(len(set(l)))


# 425 Напишіть програму, яка отримує два цілих числа в одному рядку через пропуск і виводить ці числа аналогічним чином, помінявши їх місцями.

# s = input("Write numbers: ")
# l = s.split(" ")
# print(l[-1] + " " + l[0])

# 428 Напишіть програму, яка приймає послідовність чисел, розділених комами, від користувача і створює список і кортеж з цими числами.
#
# s = input("Write numbers: ")
# lst = s.split(", ")
# l = list(map(int, lst))
# tpl = tuple(l)
# print(l)
# print(tpl)

# 429 Напишіть програму для підрахунку кількості днів, в яких температура була не нижче, ніж середня температура за весь період.
# У першому рядку вводиться список показників температури на кожен день. У рядку виведення одне число - кількість днів, які відповідають умові.

# s = input("Write temperature: ")
# l = list(map(int, s.split(" ")))
# avg = sum(l)/len(l)
# cnt = 0
#
# for i in range(len(l)):
#     if l[i] >= avg:
#         cnt +=1
# print(cnt)


# 431 Напишіть програму для друкування всіх парних чисел із введеного списку чисел у тому ж порядку і припиніть друк, якщо у списку буде число n або нуль.
# Значення списку вводяться через пропуск в одному рядку, число n вводиться у новому рядку.
# s = input("Write numbers: ")
# l = list(map(int, s.split(" ")))
#
# n = len(l)
# for i in range(len(l)):
#
#     if l[i] in (n, 0):
#         if l[i] % 2 == 0:
#             print(l[i], end=" ")
#         break
#     elif l[i]%2 == 0:
#             print(l[i], end=" ")

# 432 Напишіть програму, щоб перевірити, чи певне ціле число n перевищує всі елементи цілочисельного списку.
# Значення списку вводяться через пропуск в одному рядку, число n вводиться у новому рядку.
# s = input("Write numbers: ")
# l = list(map(int, s.split(" ")))
# n = int(input("Write num: "))
#
# res = True
# for i in range(len(l)):
#     if l[i] > n:
#         res = False
# print(res)

# 443 Циклічно посуньте елементи списку вправо (0-вий елемент переходить на місце 1-го, 1-ий на місце 2-го, ...,
# останній елемент переходить на місце 0-го). Вводиться список чисел. Всі числа списку знаходяться на одному рядку.
# s = input("Write numbers: ")
# l = list(map(int, s.split(" ")))
# resList = []
# for i in range(len(l)):
#     if i == len(l) - 1:
#         resList.insert(0, l[i])
#     else:
#         resList.insert(i + 1, l[i])
# print(resList)

#444 Напишіть програму, яка приймає послідовність слів, розділених комами і без пропусків в якості введення,
# і друкує послідовність слів, розділених комами, після сортування за алфавітом.
# s = input("Write words: ")
# l = s.split(",")
# l = sorted(l)
# print(",".join(l))

#445 Для введеної послідовності унікальних цілих чисел,
# поміняйте місцями мінімальний та максимальний елементи цієї послідовності. Надрукуйте отриманий список.

# nums = input("Write nums: ")
# l = list(map(int, nums.split(",")))
# minInt = sys.maxsize
# minIntIndex = 0
# maxInt = -sys.maxsize
# maxIntIndex = 0
# print(l)
# for i in range(len(l)):
#     if l[i] <= minInt:
#         minInt = l[i]
#         minIntIndex = i
#     if l[i] >= maxInt:
#         maxInt = l[i]
#         maxIntIndex = i
# l[minIntIndex] = maxInt
# l[maxIntIndex] = minInt
#
# print(l)

#446 Дано список чисел, підрахуйте, скільки пар елементів мають однакове значення (рівні).
# Будь-які два елементи, що дорівнюють один одному, слід вважати рівно один раз.
# nums = input("Write nums: ")
# l = list(map(int, nums.split(" ")))
# cnt = 0
# for i in range(len(l) - 1):
#     for j in range(i + 1, len(l)):
#         if l[i] == l[j]:
#             cnt+=1
# print(cnt)

#447 Напишіть програму, яка приймає послідовність рядків (порожній рядок для завершення програми)
# як вхідний рядок і друкує рядки у верхньому регістрі.

# isTrue = True
# lines = []
# while isTrue:
#     line = input("Write line: ")
#     if line == "":
#         isTrue = False
#     else:
#         lines.append(line)
#
# for i in range(len(lines)):
#     print(lines[i].upper())
#
#448 Для введеної послідовності цілих чисел обміняйте сусідні елементи у парах (A[0] з A[1], A[2] з A[3] і т. д.).
# Надрукуйте отриманий список. Якщо в списку є непарне число елементів, залиште останній елемент на місці.
nums = input("Write nums: ")
l = list(map(int, nums.split(" ")))
f = 0
s = 0
print(l)
for i in range(len(l)):
    if i%2 == 0:
        f = l[i]
    else:
        s = l[i]
        l[i-1] = s
        l[i] = f

print(l)